Clojure/clojure-javafx.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A simple Clojure javaFX application</title>
<!-- 2016-02-17 Wed 20:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">A simple Clojure javaFX application</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Leiningen Project File</a></li>
<li><a href="#sec-3">The FXML source</a></li>
<li><a href="#sec-4">Some JavaFX macros</a></li>
<li><a href="#sec-5">The controller class</a></li>
<li><a href="#sec-6">The main application class</a></li>
<li><a href="#sec-7">Source code</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
In a previous introduction to JavaFX we used Java to create a small
application, using an MVVM pattern. The original article can be
found <a href="file:///Users/john/dev/org/blog/Java/introjavafx.html">here</a>.
</p>

<p>
I thought it would be interesting to find out how to do it using
Clojure.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Leiningen Project File</h2>
<div class="outline-text-2" id="text-2">
<p>
The Leiningen project file defines the dependencies:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span class="linenr">1: </span>(<span style="color: #859900;">defproject</span> <span style="color: #268bd2;">app</span> <span style="color: #2aa198;">"0.1.0-SNAPSHOT"</span>
<span class="linenr">2: </span>  <span style="color: #2aa198;">:description</span> <span style="color: #2aa198;">"FIXME: write description"</span>
<span class="linenr">3: </span>  <span style="color: #2aa198;">:url</span> <span style="color: #2aa198;">"http://example.com/FIXME"</span>
<span class="linenr">4: </span>  <span style="color: #2aa198;">:license</span> {<span style="color: #2aa198;">:name</span> <span style="color: #2aa198;">"Eclipse Public License"</span>
<span class="linenr">5: </span>            <span style="color: #2aa198;">:url</span> <span style="color: #2aa198;">"http://www.eclipse.org/legal/epl-v10.html"</span>}
<span class="linenr">6: </span>  <span style="color: #2aa198;">:dependencies</span> [[<span style="color: #b58900;">org.clojure</span><span style="color: #839496; background-color: #002b36;">/</span>clojure <span style="color: #2aa198;">"1.7.0"</span>]
<span class="linenr">7: </span>                 [<span style="color: #b58900;">com.oracle</span><span style="color: #839496; background-color: #002b36;">/</span>javafx-runtime <span style="color: #2aa198;">"2.2.0"</span>]]
<span class="linenr">8: </span>  <span style="color: #2aa198;">:aot</span> <span style="color: #2aa198;">:all</span>
<span class="linenr">9: </span>  <span style="color: #2aa198;">:main</span> <span style="color: #b58900;">app.core</span>)
</pre>
</div>

<p>
The only dependency, other than clojure is the javafx runtime.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">The FXML source</h2>
<div class="outline-text-2" id="text-3">
<p>
The application uses an FXML file to define the structure of the
UI. This should be placed in the resources folder:
</p>

<div class="org-src-container">

<pre class="src src-xml"><span class="linenr">10: </span>&lt;?<span style="color: #859900;">xml</span> <span style="color: #268bd2;">version</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">1.0</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">encoding</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">UTF-8</span><span style="color: #2aa198;">"</span>?&gt;
<span class="linenr">11: </span>
<span class="linenr">12: </span> &lt;?<span style="color: #859900;">import</span> <span style="color: #586e75; font-style: italic;">javafx.scene.control.TextField</span>?&gt;
<span class="linenr">13: </span> &lt;?<span style="color: #859900;">import</span> <span style="color: #586e75; font-style: italic;">javafx.scene.layout.*</span>?&gt;
<span class="linenr">14: </span>
<span class="linenr">15: </span> &lt;?<span style="color: #859900;">import</span> <span style="color: #586e75; font-style: italic;">javafx.scene.control.Button</span>?&gt;
<span class="linenr">16: </span> &lt;?<span style="color: #859900;">import</span> <span style="color: #586e75; font-style: italic;">javafx.scene.control.Label</span>?&gt;
<span class="linenr">17: </span> &lt;<span style="color: #268bd2;">GridPane</span> <span style="color: #859900;">xmlns</span>:<span style="color: #268bd2;">fx</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">http://javafx.com/fxml/1</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">xmlns</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">http://javafx.com/javafx/8</span><span style="color: #2aa198;">"</span>
<span class="linenr">18: </span>           <span style="color: #268bd2;">alignment</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">center</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">hgap</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">10</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">vgap</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">10</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">fx</span>:<span style="color: #268bd2;">controller</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">app.view.Main</span><span style="color: #2aa198;">"</span>&gt;
<span class="linenr">19: </span>    &lt;<span style="color: #268bd2;">children</span>&gt;
<span class="linenr">20: </span>       &lt;<span style="color: #268bd2;">TextField</span> <span style="color: #268bd2;">GridPane.rowIndex</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">0</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">fx</span>:<span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">textField</span><span style="color: #2aa198;">"</span> /&gt;
<span class="linenr">21: </span>       &lt;<span style="color: #268bd2;">Label</span> <span style="color: #268bd2;">GridPane.rowIndex</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">1</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">fx</span>:<span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">echoTextField</span><span style="color: #2aa198;">"</span>/&gt;
<span class="linenr">22: </span>       &lt;<span style="color: #268bd2;">Button</span> <span style="color: #268bd2;">GridPane.rowIndex</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">2</span><span style="color: #2aa198;">"</span> <span style="color: #859900;">fx</span>:<span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">clearButton</span><span style="color: #2aa198;">"</span>&gt;Clear&lt;/<span style="color: #268bd2;">Button</span>&gt;
<span class="linenr">23: </span>    &lt;/<span style="color: #268bd2;">children</span>&gt;
<span class="linenr">24: </span>    &lt;<span style="color: #268bd2;">columnConstraints</span>&gt;
<span class="linenr">25: </span>       &lt;<span style="color: #268bd2;">ColumnConstraints</span> /&gt;
<span class="linenr">26: </span>    &lt;/<span style="color: #268bd2;">columnConstraints</span>&gt;
<span class="linenr">27: </span>    &lt;<span style="color: #268bd2;">rowConstraints</span>&gt;
<span class="linenr">28: </span>       &lt;<span style="color: #268bd2;">RowConstraints</span> /&gt;
<span class="linenr">29: </span>       &lt;<span style="color: #268bd2;">RowConstraints</span> /&gt;
<span class="linenr">30: </span>   &lt;/<span style="color: #268bd2;">rowConstraints</span>&gt;
<span class="linenr">31: </span> &lt;/<span style="color: #268bd2;">GridPane</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Some JavaFX macros</h2>
<div class="outline-text-2" id="text-4">
<p>
Some JavaFX macros are defined and placed in src/app:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span class="linenr">32: </span><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Some java fx macros</span>
<span class="linenr">33: </span><span style="color: #586e75; font-style: italic;">;;</span>
<span class="linenr">34: </span>(<span style="color: #859900;">ns</span> <span style="color: #b58900;">app.jfx</span>
<span class="linenr">35: </span>  (<span style="color: #2aa198;">:import</span> (<span style="color: #b58900;">javafx.beans.value</span> <span style="color: #b58900;">ChangeListener</span>)
<span class="linenr">36: </span>           (<span style="color: #b58900;">javafx.event</span> <span style="color: #b58900;">ActionEvent</span> <span style="color: #b58900;">EventHandler</span>)
<span class="linenr">37: </span>           (<span style="color: #b58900;">javafx.scene</span> <span style="color: #b58900;">Scene</span>)
<span class="linenr">38: </span>           (<span style="color: #b58900;">javafx.fxml</span> <span style="color: #b58900;">FXMLLoader</span>)))
<span class="linenr">39: </span>
<span class="linenr">40: </span>(<span style="color: #859900;">defmacro</span> <span style="color: #268bd2;">fx-load-fxml</span> [path]
<span class="linenr">41: </span>  `(<span style="color: #859900;">let</span> [loc# (<span style="color: #b58900;">clojure.java.io</span><span style="color: #839496; background-color: #002b36;">/</span>resource ~path)]
<span class="linenr">42: </span>     (<span style="color: #b58900;">FXMLLoader</span><span style="color: #839496; background-color: #002b36;">/</span>load loc#)))
<span class="linenr">43: </span>
<span class="linenr">44: </span>(<span style="color: #859900;">defmacro</span> <span style="color: #268bd2;">fx-add-text-listener</span> [text-property action]
<span class="linenr">45: </span>  `(<span style="color: #cb4b16;">.addListener</span> ~text-property
<span class="linenr">46: </span>                 (reify <span style="color: #b58900;">ChangeListener</span>
<span class="linenr">47: </span>                   (changed [this obsval oldval newval]
<span class="linenr">48: </span>                     ~action))))
<span class="linenr">49: </span>
<span class="linenr">50: </span>(<span style="color: #859900;">defmacro</span> <span style="color: #268bd2;">fx-window</span> [stage view title]
<span class="linenr">51: </span>  `(<span style="color: #859900;">let</span> [root# (<span style="color: #cb4b16;">.loadFxml</span> ~view)]
<span class="linenr">52: </span>     (<span style="color: #cb4b16;">.setScene</span> ~stage (<span style="color: #b58900;">Scene.</span> root#))
<span class="linenr">53: </span>     (<span style="color: #cb4b16;">.setTitle</span> ~stage ~title)
<span class="linenr">54: </span>     (<span style="color: #cb4b16;">.show</span> ~stage)))
<span class="linenr">55: </span>
<span class="linenr">56: </span>(<span style="color: #859900;">defmacro</span> <span style="color: #268bd2;">fx-action</span> [node action]
<span class="linenr">57: </span>  `(<span style="color: #cb4b16;">.setOnAction</span> ~node
<span class="linenr">58: </span>                 (proxy [<span style="color: #b58900;">EventHandler</span>] []
<span class="linenr">59: </span>                   (handle [^<span style="color: #b58900;">ActionEvent</span> event#]
<span class="linenr">60: </span>                     ~action))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">The controller class</h2>
<div class="outline-text-2" id="text-5">
<p>
The controller class is the code behind the FXML UI:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span class="linenr">61: </span>(<span style="color: #859900;">ns</span> <span style="color: #b58900;">app.view</span>
<span class="linenr">62: </span>  (<span style="color: #2aa198;">:gen-class</span>
<span class="linenr">63: </span>   <span style="color: #2aa198;">:name</span> <span style="color: #b58900;">app.view.Main</span>
<span class="linenr">64: </span>   <span style="color: #2aa198;">:prefix</span> view-
<span class="linenr">65: </span>   <span style="color: #2aa198;">:methods</span> [[<span style="color: #cb4b16;">loadFxml</span> [] <span style="color: #b58900;">javafx.scene.Parent</span>]])
<span class="linenr">66: </span>  (<span style="color: #2aa198;">:import</span> (<span style="color: #b58900;">javafx.scene</span> <span style="color: #b58900;">Parent</span>))
<span class="linenr">67: </span>  (<span style="color: #2aa198;">:use</span> [<span style="color: #b58900;">app.jfx</span>]))
<span class="linenr">68: </span>
<span class="linenr">69: </span>(<span style="color: #859900;">defn</span> <span style="color: #268bd2;">view-loadFxml</span> [this]
<span class="linenr">70: </span>  <span style="color: #2aa198;">"Load the FXML and create a view for display in a parent"</span>
<span class="linenr">71: </span>  (<span style="color: #859900;">let</span> [root (fx-load-fxml <span style="color: #2aa198;">"window.fxml"</span>)x
<span class="linenr">72: </span>        <span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">get references to the ids in the FXML</span>
<span class="linenr">73: </span>        clear-button (<span style="color: #cb4b16;">.lookup</span> root <span style="color: #2aa198;">"#clearButton"</span>)
<span class="linenr">74: </span>        echo-text (<span style="color: #cb4b16;">.lookup</span> root <span style="color: #2aa198;">"#echoTextField"</span>)
<span class="linenr">75: </span>        edit-text (<span style="color: #cb4b16;">.lookup</span> root <span style="color: #2aa198;">"#textField"</span>)]
<span class="linenr">76: </span>
<span class="linenr">77: </span>    <span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">add an action to the clear button</span>
<span class="linenr">78: </span>
<span class="linenr">79: </span>    (fx-action clear-button
<span class="linenr">80: </span>               (<span style="color: #859900;">do</span>
<span class="linenr">81: </span>                 (<span style="color: #cb4b16;">.setText</span> echo-text <span style="color: #2aa198;">""</span>)
<span class="linenr">82: </span>                 (<span style="color: #cb4b16;">.setText</span> edit-text <span style="color: #2aa198;">""</span>)))
<span class="linenr">83: </span>
<span class="linenr">84: </span>    <span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">add a listener to the text property on the edit control</span>
<span class="linenr">85: </span>
<span class="linenr">86: </span>    (fx-add-text-listener (<span style="color: #cb4b16;">.textProperty</span> edit-text)
<span class="linenr">87: </span>                          (<span style="color: #cb4b16;">.setText</span> echo-text
<span class="linenr">88: </span>                                    (<span style="color: #cb4b16;">.getText</span> edit-text)))
<span class="linenr">89: </span>
<span class="linenr">90: </span>    <span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">return the root</span>
<span class="linenr">91: </span>
<span class="linenr">92: </span>    root))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">The main application class</h2>
<div class="outline-text-2" id="text-6">
<p>
The main class initialises the application and executes it:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span class="linenr"> 93: </span><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">The javafx application with a main function and an</span>
<span class="linenr"> 94: </span><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">overridden start method</span>
<span class="linenr"> 95: </span><span style="color: #586e75; font-style: italic;">;;</span>
<span class="linenr"> 96: </span>(<span style="color: #859900;">ns</span> <span style="color: #b58900;">app.core</span>
<span class="linenr"> 97: </span>  (<span style="color: #2aa198;">:gen-class</span> <span style="color: #2aa198;">:extends</span> <span style="color: #b58900;">javafx.application.Application</span>)
<span class="linenr"> 98: </span>  (<span style="color: #2aa198;">:import</span> (<span style="color: #b58900;">javafx.application</span> <span style="color: #b58900;">Application</span>)
<span class="linenr"> 99: </span>           (<span style="color: #b58900;">javafx.scene</span> <span style="color: #b58900;">Scene</span>))
<span class="linenr">100: </span>  (<span style="color: #2aa198;">:use</span> [<span style="color: #b58900;">app.jfx</span>]
<span class="linenr">101: </span>        [<span style="color: #b58900;">app.view</span>]))
<span class="linenr">102: </span>
<span class="linenr">103: </span>(<span style="color: #859900;">defn</span> <span style="color: #268bd2;">-main</span> [&amp; args]
<span class="linenr">104: </span>  (<span style="color: #b58900;">Application</span><span style="color: #839496; background-color: #002b36;">/</span>launch <span style="color: #b58900;">app.core</span> args))
<span class="linenr">105: </span>
<span class="linenr">106: </span>(<span style="color: #859900;">defn</span> <span style="color: #268bd2;">-start</span> [this stage]
<span class="linenr">107: </span>  (fx-window stage (<span style="color: #b58900;">app.view.Main.</span>) <span style="color: #2aa198;">"JavaFXML with Clojure"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Source code</h2>
<div class="outline-text-2" id="text-7">
<p>
The sourcecode is available on <a href="https://github.com/johnysputnik/clojure-javafx">GitHub</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-17 Wed 20:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
